<!-- terraform cdk action for options with hash 2e679e3a099220b46f78aa91824ccd10 -->
### ✅ Successfully applied Terraform CDK Stack 'cloudwatch_alarm'



<details><summary>Show Run</summary>

```shell
(node:2291) [DEP0040] DeprecationWarning: The `punycode` module is deprecated. Please use a userland alternative instead.
(Use `node --trace-deprecation ...` to show where the warning was created)
cloudwatch_alarm  Initializing the backend...
cloudwatch_alarm  Initializing modules...
cloudwatch_alarm  Initializing provider plugins...
                  - Reusing previous version of hashicorp/aws from the dependency lock file
cloudwatch_alarm  - Using previously-installed hashicorp/aws v5.65.0

                  Terraform has been successfully initialized!

                  You may now begin working with Terraform. Try running "terraform plan" to see
                  any changes that are required for your infrastructure. All Terraform commands
                  should now work.

                  If you ever set or change modules or backend configuration for Terraform,
                  rerun this command to reinitialize your working directory. If you forget, other
                  commands will detect it and remind you to do so if necessary.
cloudwatch_alarm  data.aws_caller_identity.current (current): Reading...
cloudwatch_alarm  aws_sns_topic.ToSlack (ToSlack): Refreshing state... [id=arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack]
cloudwatch_alarm  data.aws_caller_identity.current (current): Read complete after 0s [id=931240111674]
cloudwatch_alarm  module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Refreshing state... [id=ec2_Maximum_alarm_CPUUtilization]
cloudwatch_alarm  data.aws_iam_policy_document.sns_topic_policy (sns_topic_policy): Reading...
                  data.aws_iam_policy_document.sns_topic_policy (sns_topic_policy): Read complete after 0s [id=1743289387]
cloudwatch_alarm  aws_sns_topic_policy.snsPolicy (snsPolicy): Refreshing state... [id=arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack]
cloudwatch_alarm  Terraform used the selected providers to generate the following execution plan.
                  Resource actions are indicated with the following symbols:
                    + create

                  Terraform will perform the following actions:

                    # aws_cloudformation_stack.chatbot (chatbot) will be created
                    + resource "aws_cloudformation_stack" "chatbot" {
                        + id            = (known after apply)
                        + name          = "cloudformation-chatbot"
                        + outputs       = (known after apply)
                        + parameters    = (known after apply)
                        + policy_body   = (known after apply)
                        + tags_all      = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + template_body = (known after apply)
                      }

                    # aws_iam_role.alert-to-slack (alert-to-slack) will be created
                    + resource "aws_iam_role" "alert-to-slack" {
                        + arn                   = (known after apply)
                        + assume_role_policy    = jsonencode(
                              {
                                + Statement = [
                                    + {
                                        + Action    = "sts:AssumeRole"
                                        + Effect    = "Allow"
                                        + Principal = {
                                            + Service = "chatbot.amazonaws.com"
                                          }
                                      },
                                  ]
                                + Version   = "2012-10-17"
                              }
                          )
                        + create_date           = (known after apply)
                        + force_detach_policies = false
                        + id                    = (known after apply)
                        + managed_policy_arns   = (known after apply)
                        + max_session_duration  = 3600
                        + name                  = "alert-to-slack"
                        + name_prefix           = (known after apply)
                        + path                  = "/"
                        + tags_all              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + unique_id             = (known after apply)

                        + inline_policy (known after apply)
                      }

                  Plan: 2 to add, 0 to change, 0 to destroy.
cloudwatch_alarm  aws_iam_role.alert-to-slack (alert-to-slack): Creating...
cloudwatch_alarm  aws_iam_role.alert-to-slack (alert-to-slack): Creation complete after 0s [id=alert-to-slack]
cloudwatch_alarm  aws_cloudformation_stack.chatbot (chatbot): Creating...
cloudwatch_alarm  aws_cloudformation_stack.chatbot (chatbot): Still creating... [10s elapsed]
cloudwatch_alarm  aws_cloudformation_stack.chatbot (chatbot): Creation complete after 12s [id=arn:aws:cloudformation:ap-northeast-1:931240111674:stack/cloudformation-chatbot/7b365410-77c7-11ef-af43-0acbd062bd13]
cloudwatch_alarm  Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

No outputs found.

```

</details>